Revit 2027 API
DefinitionGroup.Definitions Property
The Definitions property returns an object that contains all the shared parameter definitions within the group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Definitions Definitions { get; }
Public ReadOnly Property Definitions As Definitions
	Get
public:
property Definitions^ Definitions {
	Definitions^ get ();
}
member Definitions : Definitions with get
Property Value
Definitions
Remarks
A known definition can be retrieved, by name, using the Item property on the Definitions object. A new definition can be created by using the Create method. The Create method takes two parameters, a string for name and a type. If the creation of the definition was successful then an object representing the definition is returned by the Create method.
See Also
Reference
DefinitionGroup Class
Autodesk.Revit.DB Namespace